Revit 2027 API
StructuralSection.StructuralSectionShape Property
 The type of structural section shape.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSectionShape StructuralSectionShape { get; }
Public ReadOnly Property StructuralSectionShape As StructuralSectionShape
	Get
public:
property StructuralSectionShape StructuralSectionShape {
	StructuralSectionShape get ();
}
member StructuralSectionShape : StructuralSectionShape with get
Property Value
StructuralSectionShape
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace